In [32]:
import pandas as pd

def department_highest_salary(employee: pd.DataFrame, department: pd.DataFrame) -> pd.DataFrame:
    """
    要保留相同最高工资的
    """
    # 重命名
    employee = employee.rename(columns={"name": "Employee", "salary": "Salary"})
    # 合并表
    new_df = employee.join(department.set_index("id").rename(columns={"name": "Department"}), on="departmentId", how='left')
    # 按部门分组，找到每个部门的最高工资
    new_df = new_df.groupby("Department").apply(lambda x: x[x.Salary == x.Salary.max()])
    # 重置索引
    new_df = new_df[["Employee", "Department", "Salary"]].reset_index(drop=True)
    return new_df

In [2]:
data = [[1, 'Joe', 70000, 1], [2, 'Jim', 90000, 1], [3, 'Henry', 80000, 2], [4, 'Sam', 60000, 2], [5, 'Max', 90000, 1]]
Employee = pd.DataFrame(data, columns=['id', 'name', 'salary', 'departmentId']).astype({'id':'Int64', 'name':'object', 'salary':'Int64', 'departmentId':'Int64'})
data = [[1, 'IT'], [2, 'Sales']]
Department = pd.DataFrame(data, columns=['id', 'name']).astype({'id':'Int64', 'name':'object'})

In [3]:
Employee

   id   name  salary  departmentId
0   1    Joe   70000             1
1   2    Jim   90000             1
2   3  Henry   80000             2
3   4    Sam   60000             2
4   5    Max   90000             1

In [4]:
Department

   id   name
0   1     IT
1   2  Sales

In [33]:
department_highest_salary(Employee, Department)

  Employee Department  Salary
0      Jim         IT   90000
1      Max         IT   90000
2    Henry      Sales   80000

In [15]:
Department.set_index("id").rename(columns={"name": "Department"})

   Department
id
1          IT
2       Sales

In [17]:
new_df = Employee.join(Department.set_index("id").rename(columns={"name": "Department"}), on="departmentId", how='left')
new_df

   id   name  salary departmentId Department
0   1    Joe   70000            1         IT
1   2    Jim   90000            1         IT
2   3  Henry   80000            2      Sales
3   4    Sam   60000            2      Sales
4   5    Max   90000            1         IT

In [36]:
# 题解中的操作, 获取每个员工对应的部门的最高工资, 长度和 new_df 相同, 一一对应
new_df.groupby("Department")["salary"].transform("max")

0    90000
1    90000
2    80000
3    80000
4    90000
Name: salary, dtype: Int64

In [18]:
new_df.groupby("Department").apply(lambda x: x[x.salary == x.salary.max()])

              id   name  salary departmentId Department
Department
IT         1   2    Jim   90000            1         IT
           4   5    Max   90000            1         IT
Sales      2   3  Henry   80000            2      Sales

In [27]:
new_df.groupby("Department").apply(lambda x: x[x.salary == x.salary.max()])[["name", "Department", "salary"]].reset_index(drop=True)

    name Department  salary
0    Jim         IT   90000
1    Max         IT   90000
2  Henry      Sales   80000

In [25]:
new_df.sort_values(by="salary", ascending=False)

   id   name  salary departmentId Department
1   2    Jim   90000            1         IT
4   5    Max   90000            1         IT
2   3  Henry   80000            2      Sales
0   1    Joe   70000            1         IT
3   4    Sam   60000            2      Sales

In [ ]:
new_df.sort_values(by="salary", ascending=False).drop_duplicates(subset="Department", keep="first")